In [ ]:
%load_ext sql

In [ ]:
%%sql sqlite:///books.db
CREATE TABLE BOOKS(book,author,price)

In [ ]:
%%sql
INSERT INTO BOOKS VALUES('The Celestine Prophecy','James Redfield',400);
INSERT INTO BOOKS VALUES('The Secret','Ronda Byrne',500);
INSERT INTO BOOKS VALUES('The Alchemist','Paulo Coelho',300);
INSERT INTO BOOKS VALUES('The Book Theif','Markus Zusak',350);

In [ ]:
%%sql
SELECT * FROM BOOKS

In [ ]:
%%sql
select book from BOOKS where price < 500

In [ ]:
%%sql
select book from BOOKS where price is not 350

In [ ]:
%%sql
select author from BOOKS where book='The Secret' and price=500

In [ ]:
%%sql
select author from BOOKS where book='The Secret' or price > 1000

In [ ]:
%%sql
select * from BOOKS 
order by author ASC, price DESC

In [ ]:
 #don't works with several cols so will
                                    #ignore the second condtion

In [ ]:
%%sql
INSERT INTO BOOKS VALUES('Harry Potter','JK Rowling',555)

In [ ]:
%%sql
SELECT * FROM BOOKS

In [ ]:
%%sql 
INSERT INTO BOOKS VALUES('Elon Musk','AShlee Vance',Null)

In [ ]:
%%sql
select book,author,price from BOOKS where price is null

In [ ]:
%%sql
update BOOKS
set price = 599
where author = 'JK Rowling'

In [ ]:
%%sql 
delete from BOOKS 
where price = 599

In [ ]:
%%sql
select * from BOOKS limit 3

In [ ]:
%%sql
select min(price) as min_price from BOOKS

In [ ]:
%%sql
select max(price) as max_price from BOOKS

In [ ]:
%%sql
select count(book) from BOOKS

In [ ]:
%%sql
select avg(price) from BOOKS   #average or sum()

In [ ]:
%%sql
select book,author from BOOKS where author like'A%'#finds patterns

In [ ]:
%%sql
select book,author from BOOKS where book like'%k'

In [ ]:
%%sql
select book,author from BOOKS where author in ('AShlee Vance','James Redfield')